INSERT INTO public.users (name, login, password) VALUES
('admin', 'admin', 'admin');


INSERT INTO public.languages (name, short_name) VALUES
('Русский', 'ru'),
('Английский', 'en'),
('Китайский', 'ch'),
('Японский', 'jp'),
('Французский', 'fr'),
('Германский', 'ge'),
('Итальянский', 'it'),
('Испанский', 'sp'),
('Украинский', 'ua');

INSERT INTO public.countries (name) VALUES
('Россия'),
('США'),
('Китай'),
('Япония'),
('Великобритания'),
('Франция'),
('Германия'),
('Италия'),
('Украина'),
('Беларусь'),
('Испания');


INSERT INTO public.publishers (name, country_id) VALUES
('Вильямс', 1),
('Питер', 1),
('БХВ Петербург', 1),
('NetLib', 2),
('Наука', 1);

INSERT INTO public.authors (first_name, sur_name, last_name) VALUES
('Генри', 'Уоррен', ''),
('Александр', 'Крупник', 'Борисович'),
('Александр', 'Побегайло', 'Павлович'),
('Михаил', 'Фленов', 'Евгеньевич'),
('Джим', 'Адамс', ''),
('Юрий', 'Рябов', 'Александрович'),
('Нишант', 'Шакла', '');

INSERT INTO public.books (isbn, title, publish_year, publisher_id, language_id) VALUES
('978-5-8459-1838-3', 'Алгоритмические трюки для программистов, 2-е изд.', 2014, 1, 1),
('5-94723-757-1', 'Изучаем Ассемблер', 2004, 2, 1),
('5-94157-792-3', 'Системное программирование в Windows', 2006, 3, 1),
('5-94157-913-6', 'Web-сервер глазами хакера', 2007, 3, 1),
('1-59200-315-X', 'Программирование ролевых игр с DirectX (2-е издание)', 2004, 4, 1),
('', 'Движения небесных тел', 1977, 5, 1),
('978-5-4461-0826-8', 'Машинное обучение и TensorFlow', 2019, 2, 1);

INSERT INTO public.bookauthors(author_id, book_id) VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7);